---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InternalProblemsParameter
source: html/b258081e-63b4-d859-1ab0-2c60a1aebe2d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InternalProblemsParameter Property

Parameter cannot be changed due to internal problems.

## Syntax (C#)
```csharp
public static FailureDefinitionId InternalProblemsParameter { get; }
```